clear all
close all
clc

load R_2;load R_3;load R_4 %载入电阻率参数
load H_2;load H_3;load H_4 %载入厚度参数

i=8; %模型编号
R=R4(i,:); %选取模型的电阻率参数
% R=[100 300 100];
H=H4(i,:); %选取模型的电阻率参数
hm=10000; %最大测量厚度（m）
dx=0.1; %绘制坐标间隔

N=length(R); %模型层数
xm=fix(log10(hm)+0.5); %最大横坐标
x=0:dx:xm; %采样点x坐标
for i=1:length(x)
   h(i)=10^x(i); %计算采样点深度
   Rs(i)=sdcs1dford(h(i),N,R,H); %计算视电阻率
end

figure
plot(log10(h),log10(Rs),'*-') %绘制双坐标电阻率曲线
xlabel('log(H)');
ylabel('log(R)');
grid on
axis equal

%模型代号
% R2(1,:)=[100 1000];H2(1,:)=[10]; %G型
% R2(2,:)=[1000 100];H2(2,:)=[10]; %D型
% R3(1,:)=[100 500 3000];H3(1,:)=[2 500]; %A型
% R3(2,:)=[100 300 50];H3(2,:)=[5 100]; %K型
% R3(3,:)=[300 100 400];H3(3,:)=[3 100]; %H型
% R3(4,:)=[300 50 10];H3(4,:)=[5 200]; %Q型
% R4(1,:)=[20 50 200 500];H4(1,:)=[2 25 1000]; %AA型
% R4(2,:)=[100 300 1000 200];H4(2,:)=[2 50 500]; %AK型
% R4(3,:)=[100 300 20 500];H4(3,:)=[2 50 500]; %KH型
% R4(4,:)=[100 300 100 20];H4(4,:)=[2 50 500]; %KQ型
% R4(5,:)=[50 20 60 200];H4(5,:)=[2 20 700]; %HA型
% R4(6,:)=[50 20 60 10];H4(6,:)=[2 20 700]; %HK型
% R4(7,:)=[100 30 10 60];H4(7,:)=[2 20 700]; %QH型
% R4(8,:)=[100 30 10 5];H4(8,:)=[2 20 700]; %QQ型